DataProcessors/МобильноеРабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МобильноеРабочееМестоКладовщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/РасходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходныйОрдерНаТовары</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыКОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОтбору</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Доставка</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Рейс</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкаПоЗаданиюНаПеревозку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отгрузил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкладскиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыПоРаспоряжениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтгружаемыеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоУпаковочныйЛист</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛистРодитель</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/МобильноеРабочееМестоКладовщика/Forms/Товары/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипДокумента = Параметры.ТипДокумента;
	Штрихкод = Параметры.Штрихкод;
	ПорядокСканирования = Параметры.ПорядокСканирования;
	
	Элементы.НачатьПриемку.Видимость = ТипДокумента = 1;
	Элементы.НачатьОтгрузку.Видимость = ТипДокумента = 2 Или ТипДокумента = 3;
				
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураЗаполнения); 
	
	Если ТипДокумента = 1 Тогда
		Распоряжение = Параметры.СтруктураЗаполнения.Распоряжение;
		РаспоряжениеСтрока = СформироватьПредставлениеРаспоряжения(Параметры.НазваниеДокумента, Параметры.Номер,
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, "Дата"));
		КонтролируемаяПартия = Параметры.СтруктураЗаполнения.КонтролируемаяПартия;
		РезультатЗапроса = 
			Обработки.МобильноеРабочееМестоКладовщика.СписокТоваровНаОтгрузкуПриемку(
				Параметры.ТипДокумента,
				Распоряжение,
				КонтролируемаяПартия);
			
		Элементы.Отправитель.Видимость = (ТипЗнч(Отправитель) = Тип("СправочникСсылка.Партнеры") Или ТипЗнч(Отправитель) = Тип("СправочникСсылка.ФизическиеЛица"));
	ИначеЕсли ТипДокумента = 2 Тогда 
		РаспоряжениеОтгрузка = Параметры.СтруктураЗаполнения.Распоряжение;
		РаспоряжениеСтрока = СформироватьПредставлениеРаспоряжения(Параметры.НазваниеДокумента, Параметры.Номер,
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РаспоряжениеОтгрузка, "Дата"));
		РезультатЗапроса = 
			Обработки.МобильноеРабочееМестоКладовщика.СписокТоваровНаОтгрузкуПриемку(Параметры.ТипДокумента, РаспоряжениеОтгрузка);
			
		Элементы.Получатель.Видимость = (ТипЗнч(Получатель) = Тип("СправочникСсылка.Партнеры") Или ТипЗнч(Получатель) = Тип("СправочникСсылка.ФизическиеЛица"));
	Иначе
		РасходныйОрдер = Параметры.СтруктураЗаполнения.Распоряжение;	
		РезультатЗапроса = СписокТоваровНаОтгрузкуПоОрдеру();
	
		ДатаНомерОрдера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РасходныйОрдер, "Дата, Номер");
		НазваниеДокумента = НСтр("ru = 'Расходный ордер'");
		РаспоряжениеСтрока = СформироватьПредставлениеРаспоряжения(НазваниеДокумента, ДатаНомерОрдера.Номер,
				ДатаНомерОрдера.Дата);
		Элементы.Получатель.Видимость = (ТипЗнч(Получатель) = Тип("СправочникСсылка.Партнеры") Или ТипЗнч(Получатель) = Тип("СправочникСсылка.ФизическиеЛица"));
		Элементы.НачатьОтгрузку.Заголовок = НСтр("ru = 'Начать отбор'");
	КонецЕсли;
		
	Товары.Загрузить(РезультатЗапроса);

	ПоказыватьФотоТоваров = Параметры.ПоказыватьФотоТоваров;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		// ПодключаемоеОборудование
		Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
			
			ЕстьНеобработанноеСобытие = МобильноеРабочееМестоКладовщикаКлиент.ЕстьНеобработанноеСобытие();
			Если ИмяСобытия = "ScanData" И ЕстьНеобработанноеСобытие Тогда
		
				Если ТипДокумента = 1 Тогда 
					НачатьПриемку();
				ИначеЕсли ТипДокумента = 2 Или ТипДокумента = 3 Тогда
					НачатьОтгрузку();
				КонецЕсли;
			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("Серия", Элемент.ТекущиеДанные.Серия);
	ПараметрыФормы.Вставить("Назначение", Элемент.ТекущиеДанные.Назначение);
	ПараметрыФормы.Вставить("Упаковка", Элемент.ТекущиеДанные.Упаковка);
	ПараметрыФормы.Вставить("Количество", Элемент.ТекущиеДанные.КоличествоУпаковок);
	ПараметрыФормы.Вставить("Режим", "Просмотр");
	ПараметрыФормы.Вставить("НомерСтроки", Элемент.ТекущаяСтрока); 
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
	ПараметрыФормы.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.КарточкаТовара",ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьПриемкуКоманда(Команда)
	
	НачатьПриемку()
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтгрузкуКоманда(Команда)
	
	НачатьОтгрузку()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПредставлениеРаспоряжения(НазваниеДокумента, Номер, Дата)
	
	СокрНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер);

	Возврат СтрШаблон(НСтр("ru = '%1 № %2 от %3'"), НазваниеДокумента, СокрНомер, Формат(Дата, НСтр("ru = 'ДФ=''дд.ММ.гг ЧЧ:мм'''")));
	
КонецФункции 

&НаКлиенте
Процедура НачатьПриемку()
	
	Если Товары.Количество() = 0 Тогда  
		Состояние(НСтр("ru = 'Нет товаров для приемки'"));
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = ПолучитьСтруктуруЗаполненияОрдера();
	
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ЭтотОбъект);
	
	Описание = Новый ОписаниеОповещения("ЗакрытьФорму", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента", 1);
	ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);  
	ПараметрыФормы.Вставить("СтруктураЗаполнения", СтруктураЗаполнения);
	ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
	ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

	ОткрытьФорму(
	"Обработка.МобильноеРабочееМестоКладовщика.Форма.ПриходныйОрдер",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтгрузку()
	
	ОчиститьСообщения();
	
	Если Товары.Количество() = 0 Тогда
		Состояние(НСтр("ru = 'Нет товаров для отгрузки'")); 
		Возврат;
	КонецЕсли; 
	
	Описание = Новый ОписаниеОповещения("ЗакрытьФорму", ЭтотОбъект);

	Если ТипДокумента = 3 Тогда
		
		УказаниеСерий = ПроверитьСтатусУказанияСерийПриПланированииОтбора(РасходныйОрдер); 
		
		Если УказаниеСерий Тогда
			
			ОчиститьСообщения();
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ссылка",РасходныйОрдер);
			ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров); 
			ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
			ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

			ОткрытьФорму(
				"Обработка.МобильноеРабочееМестоКладовщика.Форма.РасходныйОрдер", ПараметрыФормы,
				ЭтотОбъект,,,,Описание,
				РежимОткрытияОкнаФормы.Независимый);
				
			Возврат;
		КонецЕсли;
		
		СсылкаОтбор = НовыйОтборТоваров(РасходныйОрдер);

		Если Не ЗначениеЗаполнено(СсылкаОтбор) Тогда		
			ТекстОшибки = НСтр("ru = 'Не удалось сформировать задания на отбор товаров согласно правилам отбора.'");
			Состояние(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", СсылкаОтбор);
		ПараметрыФормы.Вставить("Исполнитель", Исполнитель);
		ПараметрыФормы.Вставить("Бесшовный", Истина);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.Отбор", ПараметрыФормы,
			ЭтотОбъект,,,,Описание,
			РежимОткрытияОкнаФормы.Независимый);
			
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = ПолучитьСтруктуруЗаполненияРасходногоОрдера();
	
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ЭтотОбъект);
	СтруктураЗаполнения.РаспоряженияНаОтгрузку.Добавить(РаспоряжениеОтгрузка);
	
	РезультатСоздания = НовыйРасходныйОрдер(СтруктураЗаполнения);
	
	Если Не ЗначениеЗаполнено(РезультатСоздания.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьАдресноеХранение = ЭтоАдресноеХранение(РезультатСоздания.Ссылка);
	
	Если ИспользоватьАдресноеХранение Тогда  
		
		Если РезультатСоздания.ТребуетсяУказаниеСерии Тогда
			
			ОчиститьСообщения();
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ссылка", РезультатСоздания.Ссылка);
			ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров); 
			ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
			ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

			ОткрытьФорму(
				"Обработка.МобильноеРабочееМестоКладовщика.Форма.РасходныйОрдер", ПараметрыФормы,
				ЭтотОбъект,,,,Описание,
				РежимОткрытияОкнаФормы.Независимый);
				
			Возврат;
		КонецЕсли;

		СсылкаОтбор = НовыйОтборТоваров(РезультатСоздания.Ссылка);
		
		Если Не ЗначениеЗаполнено(СсылкаОтбор) Тогда
			ТекстОшибки = НСтр("ru = 'Не удалось сформировать задания на отбор товаров согласно правилам отбора.'");
			Состояние(ТекстОшибки);
			Возврат;
		КонецЕсли;
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", СсылкаОтбор);
		ПараметрыФормы.Вставить("Исполнитель", Исполнитель);
		ПараметрыФормы.Вставить("Бесшовный", Истина);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.Отбор", ПараметрыФормы,
			ЭтотОбъект,,,,Описание,
			РежимОткрытияОкнаФормы.Независимый);
		
	Иначе
		
		Если РезультатСоздания.ЕстьОшибка Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", РезультатСоздания.Ссылка);
		ПараметрыФормы.Вставить("ПоказыватьФотоТоваров", ПоказыватьФотоТоваров);
		ПараметрыФормы.Вставить("Штрихкод", Штрихкод);
		ПараметрыФормы.Вставить("ПорядокСканирования", ПорядокСканирования);

		ОткрытьФорму(
			"Обработка.МобильноеРабочееМестоКладовщика.Форма.РасходныйОрдер", ПараметрыФормы,
			ЭтотОбъект,,,,Описание,
			РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруЗаполненияОрдера()
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.СтруктураЗаполненияПриходногоОрдера();
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруЗаполненияРасходногоОрдера()
	
	Возврат СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
	
КонецФункции

&НаСервере
Функция ЭтоАдресноеХранение(Знач СсылкаНаРасходныйОрдер)
	
	СвойстваСклада = Обработки.МобильноеРабочееМестоКладовщика.СвойстваСклада(Склад);	
	ИспользоватьАдресноеХранение = СвойстваСклада.ИспользоватьАдресноеХранение;
	Помещение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаРасходныйОрдер, "Помещение");
	Если СвойстваСклада.ИспользоватьСкладскиеПомещения Тогда
		СтруктураПомещения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Помещение, "ИспользоватьАдресноеХранение");
		ИспользоватьАдресноеХранение = СтруктураПомещения.ИспользоватьАдресноеХранение;
	КонецЕсли;
	
	Возврат ИспользоватьАдресноеХранение;
	
КонецФункции

&НаСервере
Функция ПроверитьСтатусУказанияСерийПриПланированииОтбора(Знач СсылкаНаРасходныйОрдер)
	
	УказаниеСерий = 
		Обработки.МобильноеРабочееМестоКладовщика.ПроверитьСтатусУказанияСерийПриПланированииОтбора(СсылкаНаРасходныйОрдер, 
		Склад);
	
	Возврат УказаниеСерий;
	
КонецФункции

&НаСервере
Функция СписокТоваровНаОтгрузкуПоОрдеру()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		|	ТоварыПоРаспоряжениям.Номенклатура.Артикул КАК Артикул,
		|	ТоварыПоРаспоряжениям.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	ТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
		|	ТоварыПоРаспоряжениям.Серия КАК Серия,
		|	ТоварыПоРаспоряжениям.Назначение КАК Назначение,
		|	ТоварыПоРаспоряжениям.Количество КАК Количество,
		|	ТоварыПоРаспоряжениям.Количество КАК КоличествоУпаковок
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям
		|ГДЕ
		|	ТоварыПоРаспоряжениям.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РасходныйОрдер);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыйРасходныйОрдер(Знач СтруктураЗаполнения)
		
	Возврат Обработки.МобильноеРабочееМестоКладовщика.НовыйРасходныйОрдер(СтруктураЗаполнения);

КонецФункции 

&НаСервереБезКонтекста
Функция НовыйОтборТоваров(Знач СсылкаРасходныйОрдер)
		
	Возврат Обработки.МобильноеРабочееМестоКладовщика.НовыйОтборТоваров(СсылкаРасходныйОрдер);

КонецФункции

#КонецОбласти
